[
    {
        "Month": "January",
        "Title": "Raindrops Keep Falling On My Head",
        "About": "The single by B. J. Thomas reached No. 1 on charts in the United States, Canada, Norway and reached No. 38 in the UK Singles Chart. It topped the Billboard Hot 100 for four weeks in January 1970 and was also the first American No. 1 hit of the 1970s. The song also spent seven weeks atop the Billboard adult contemporary chart. Billboard ranked it as the No. 4 song of 1970. According to Billboard magazine, Thomas' single had sold over 2 million copies by March 14, 1970, with eight-track and cassette versions also climbing the charts. It won an Oscar for Best Original Song. Bacharach also won Best Original Score."        
    },

    {
        "Month": "February",
        "Title": "Thank You (Falettinme Be Mice Elf Agin)",
        "About": "This is a 1969 song recorded by Sly and the Family Stone. The song, released as a double A-side single with 'Everybody Is a Star', reached number one on the soul single charts for five weeks, and reached number one on the Billboard Hot 100 in February 1970. Billboard ranked the record as the No. 19 song of 1970."

    },

    {
        "Month": "March",
        "Title": "Bridge Over Troubled Waters",
        "About": "This is a song composed by American singer-songwriter Paul Simon and recorded by Simon & Garfunkel. Produced by the duo and Roy Halee, the song was released as the follow-up single to 'The Boxer' in January 1970. The song is featured on their fifth studio album, Bridge over Troubled Water (1970). Art Garfunkel performs lead vocals over a piano accompaniment exhibiting strong influence of gospel music. The original studio recording employs elements of Phil Spector's 'Wall of Sound' technique using L.A. session musicians from the Wrecking Crew."
        
    },

    {
        "Month": "April",
        "Title": "Let It Be",
        "About": "This song by the English rock band the Beatles, was released on 6 March 1970 as a single, and (in an alternative mix) as the title track of their album Let It Be. It was written and sung by Paul McCartney, and credited to the Lennon–McCartney partnership. The single version of the song, produced by George Martin, features a softer guitar solo and the orchestral section mixed low, compared to the album version, produced by Phil Spector, featuring a more-aggressive guitar solo and the orchestral sections mixed higher.  At the time, it had the highest debut on the Billboard Hot 100, beginning its chart run at number 6 and eventually reaching the top. It was their final single before McCartney announced his departure from the band."
    },
    
    {
        "Month": "May",
        "Title": "American Woman",
        "About": "'American Woman' is a song released by the Canadian rock band The Guess Who in January 1970, from their sixth studio album of the same name. It was later released in March 1970 as a single backed with 'No Sugar Tonight', and it reached number one for three weeks commencing May 9 on both the United States' Billboard Hot 100 and the Canadian RPM magazine singles chart.  Billboard magazine placed the single at number three on the Year-End Hot 100 singles of 1970 list, and it was listed as number five for 1970 on the RPM Year-End Chart. On May 22, 1970, the single was certified as gold by the RIAA. It also reached the top ten in the Netherlands, Switzerland and Austria, and the top twenty in the United Kingdom and New Zealand.  Produced by Jack Richardson, the single was recorded on August 13, 1969, at RCA's Mid-America Recording Center in Chicago."
    },
    
    {
        "Month": "June",
        "Title": "The Long And Winding Road",
        "About": "This Beatle's song is from their 1970 album Let It Be. It was written by Paul McCartney and credited to Lennon–McCartney. When issued as a single in May 1970, a month after the Beatles' break-up, it became the group's 20th and last number-one hit on the Billboard Hot 100 chart in the United States.  The main recording of the song took place in January 1969 and featured a sparse musical arrangement. When preparing the tapes from these sessions for release in April 1970, producer Phil Spector added orchestral and choral overdubs. Spector's modifications angered McCartney to the point that when the latter made his case in the English High Court for the Beatles' disbandment, he cited the treatment of 'The Long and Winding Road' as one of six reasons for doing so. New versions of the song with simpler instrumentation were subsequently released by McCartney and by the Beatles."
    },
    
    {
        "Month": "July",
        "Title": "Mama Told Me (Not To Come)",
        "About": "This song by American singer-songwriter Randy Newman was originally written for Eric Burdon's first solo album in 1966.   A scheduled single-release of September 1966 was withdrawn.  In 1970, Three Dog Night released a longer, rock 'n roll and funk-inspired version (titled 'Mama Told Me (Not to Come)' on It Ain't Easy.   This version had the same 3/4 by 2/4 time change as Eric Burdon's version and featured Cory Wells singing lead in an almost humorous vocal style, Jimmy Greenspoon playing a Wurlitzer electric piano, Michael Allsup playing guitar, and Donna Summer on backing vocals, though uncredited.  Billboard ranked the record as the No. 11 song of 1970."
    },
    
    {
        "Month": "August",
        "Title": "Close To You",
        "About": "This is a song written by Burt Bacharach and Hal David. The most well-known version is that recorded by American duo The Carpenters for their second studio album Close to You (1970) and produced by Jack Daugherty. Released on May 14, 1970, the single topped both the US Billboard Hot 100 and Adult Contemporary charts. It also reached the top of the Canadian and Australian charts, and peaked at number six on the charts of both the UK and Ireland.   Billboard ranked it as the number two song for 1970."
    },
    
    {
        "Month": "September",
        "Title": "War",
        "About": "'War' is a counterculture era soul song written by Norman Whitfield and Barrett Strong for the Motown label in 1969. Whitfield first produced the song – an obvious anti-Vietnam War statement – with The Temptations as the original vocalists. After Motown began receiving repeated requests to release 'War' as a single, Whitfield re-recorded the song with Edwin Starr as the vocalist, with the label deciding to withhold the Temptations' version from single release so as not to alienate their more conservative fans.  Upon its release in June 1970, Starr's 'War' became a runaway hit, and held the No. 1 position on the Billboard Pop Singles chart for three weeks, in August and September 1970.  Billboard ranked it as the No. 5 song of 1970."
    },
    
    {
        "Month": "October",
        "Title": "I'll Be There",
        "About": "This song was written by Berry Gordy, Hal Davis, Bob West, and Willie Hutch. The song was recorded by The Jackson 5 and released by Motown Records on August 28, 1970 as the first single from their Third Album on the same date. Produced by the songwriters, 'I'll Be There' was The Jackson 5's fourth number-one hit in a row, making them the first group to have their first four singles reach number one and the first black Male group with four consecutive number-one pop hits."
    },
    
    {
        "Month": "November",
        "Title": "I Think I Love You",
        "About": "This is a song by Tony Romeo, written as the debut single for fictional musical TV family The Partridge Family, released in August 1970, a month prior to the debut of the ABC-TV musical sitcom The Partridge Family starring Shirley Jones and featuring David Cassidy, both of whom appear on the record, with Cassidy as lead vocalist. The single topped Billboard's Hot 100 for three weeks in November and December 1970 and later was certified by NARM as the best-selling single of 1970.  As with all of the Partridge Family's studio output, the single features musicians associated with iconic Los Angeles-based session players 'the Wrecking Crew'."
    },
    
    {
        "Month": "December",
        "Title": "The Tears Of A Clown",
        "About": "This is a song written by Hank Cosby, Smokey Robinson, and Stevie Wonder and originally recorded by Smokey Robinson & the Miracles for the Tamla Records label subsidiary of Motown, first appearing on the 1967 album Make It Happen. It was re-released in the United Kingdom as a single in July 1970, and it became a #1 hit on the UK Singles Chart for the week ending 12 September 1970. Subsequently, Motown released 'The Tears of a Clown' as a single in the United States as well, where it quickly became a #1 hit on both the Billboard Hot 100 and R&B Singles charts."
    }
]
